html/Berger-remark-complex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-06 Tue 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Berger classification and remarks on parallel structures</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="darknmt" />
<link href='http://fonts.googleapis.com/css?family=Libre+Baskerville:400,400italic' rel='stylesheet' type='text/css'>
<link rel='stylesheet' href='../res/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='./index.html'>Home</a></li>
<li><a href='./blog.html'>Blog</a></li>
<li><a href='http://github.com/darknmt/'>GitHub</a></li>
<li><a href='/contact.html'>Contact</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Berger classification and remarks on parallel structures</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd528a91">1. Our story so far</a></li>
<li><a href="#org8cb08e7">2. Berger classification for non-symmetric manifolds</a></li>
<li><a href="#orgc0ea7a3">3. Almost complex structure</a></li>
<li><a href="#org410da11">4. Chern class and Calabi conjecture (Yau theorem)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd528a91" class="outline-2">
<h2 id="orgd528a91"><span class="section-number-2">1</span> Our story so far</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="./de-rham-decomposition.html">De Rham decomposition theorem</a> theorem allows us to split a Riemannian manifold under certain
conditions (complete and connected) as Riemannian product of complete connected manifold with
<i>irreducible holonomy representation</i>. We will now interest in manifolds with irreducible
holonomies. If the manifold is <a href="./symmetric-space.html"><i>locally symmetric</i></a> then one can prove that it is isometric to the
homogeneous space \(G/H\) with \(H\) (the holonomy) a closed Lie subgroup of \(G\). The theory of Lie
groups developed by E. Cartan gave a complete list of these spaces.
</p>
</div>
</div>


<div id="outline-container-org8cb08e7" class="outline-2">
<h2 id="org8cb08e7"><span class="section-number-2">2</span> Berger classification for non-symmetric manifolds</h2>
<div class="outline-text-2" id="text-2">
<div class="theorem">
<p>
<a id="org32b6fde"></a>
For the non-symmetric irreducible manifold, the holonomy representation has to be one of the
following
</p>
<ol class="org-ol">
<li>\(SO(n)\)</li>
<li>\(U(m)\subset SO(2m)\)</li>
<li>\(SU(m)\subset SO(2m)\)</li>
<li>\(Sp(r) \subset SO(4r)\)</li>
<li>\(SO(r)Sp(1) \subset SO(4r)\)</li>
<li>\(G_2\subset SO(7)\)</li>
<li>\(\text{Spin}(7)\subset SO(8)\)</li>
</ol>
<p>
where \(n=2m=4r\) is the dimension.
</p>

</div>

<p>
Here are some notations, note always that
\[
Sp(m)\subset SU(2m)\subset U(2m)\subset SO(4m)
\]
</p>
<ol class="org-ol">
<li>If \(Hol(g)\subset U(m)\subset SO(2m)\), \(g\) is called a <i>Kahler metric</i>.</li>
<li>If \(Hol(g)\subset SU(m)\subset SO(2m)\), \(g\) is called a <i>Calabi-Yau</i> metric. We will see that a
Calabi-Yau metric is a Kahler metric that is also Ricci-flat.</li>
<li>If \(Hol(g)\subset Sp(m)\subset SO(4m)\) then \(g\) is called a <i>hyperkahler</i> metric.</li>
<li>\(G_2\) and \(\text{Spin}(7)\) are called <i>exceptional holonomies</i></li>
</ol>

<p>
To resume: hyperkahler \(\longrightarrow\) Calabi-Yau \(\longrightarrow\) Kahler
</p>

<p>
But wait.. you said \(SU(n)\subset SO(2n)\)? To embed \(SU(n)\) in \(SO(2n)\) one need to identify \(
\mathbb{C}\) and \( \mathbb{R}^{2n}\), this can be done using an almost complex structure \(J\) of \(
\mathbb{R}^n\). We will prove that when we change the almost complex structure, the embeded image of
\(SU(n)\) in \(SO(2n)\) always remains in the same conjugacy class, which works out perfectly with the
fact that while holonomy representation is well-defined, the holonomy group in \(SO(2n)\) is only
defined up to its conjugacy class as one has to fix a basis
</p>
</div>
</div>

<div id="outline-container-orgc0ea7a3" class="outline-2">
<h2 id="orgc0ea7a3"><span class="section-number-2">3</span> Almost complex structure</h2>
</div>



<div id="outline-container-org410da11" class="outline-2">
<h2 id="org410da11"><span class="section-number-2">4</span> Chern class and Calabi conjecture (Yau theorem)</h2>
<div class="outline-text-2" id="text-4">
<p>
The Chern class \(c_1(M)\) of a Riemannian manifold is the class in \(H^{1,1}(M)\) of the Ricci
curvature. It is easy to see that two different kahler metric give the same Chern class. The
conjecture posed by Calabi asks <b>whether we can modify the kahler metric to attain, as Ricci
curvature, every \((1,1)\) form in the original Chern class</b>. The response, which is positive, was
given by S.T. Yau.
</p>

<div class="theorem">
<p>
<a id="orgf495135"></a>
Let \(M\) be a compact manifold with a Kahler form \(\omega\) and the corresponding Ricci curvature
\(R_\omega\). Let \(R\) be a \((1,1)\) form cohomologous to \(R_\omega\), then there exists a Kahler form
\(\omega'\) cohomologous to \(\omega\) such that \(R'\) is the Ricci curvature of \(\omega'\).
</p>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='footer'>
By darknmt.<br>
Last updated 2017-06-06 Tue 00:10. <br>
</div>
</div>
</body>
</html>
